app/Http/Controllers/User/UserAuthController.php

select * from `users` where `email` = 'vodev1405@gmail.com'
---
    public function postLogin(UserLoginRequest $request)
    {
        $validated = $request->validated();
        $user = User::where('email', $validated['email'])->get()->first();