app/Policies/UserPolicy.php

select * from `banned_users` where `user_id` = '01K4YRC123VSNMKBP8AN5RZ4G3'
---
    public function banned(User $user)
    {
        $banned = BannedUser::where('user_id', $user->ulid)->get()->first();